In [9]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [10]:
data = {

    '이름' : ['채치수', '정대만','송태섭','서태웅','강백호','변덕규','황태산','윤대형'],

    '학교' : ['북산고','북산고','북산고','북산고','북산고','능남고','능남고','능남고'],

    '키' : [197, 184, 168, 187, 188, 202, 188, 190],

    '국어' : [90, 40, 70, 40, 15, 80, 55, 100],

    '영어' : [85, 35, 75, 50, 20, 100, 65, 85],

    '수학' : [100, 50, 70, 70, 10, 95, 45, 90],

    '과학' : [95, 55, 80, 75, 35, 85, 40, 95],

    '사회' : [85, 25, 75, 80, 10, 80, 35, 95],

    'SW특기' : ['Python', 'Java','javascript','','','C','PYTHON','C#']

}

In [11]:
df_data = pd.DataFrame(data=data)

In [12]:
df_data

    이름   학교    키   국어   영어   수학  과학  사회        SW특기
0  채치수  북산고  197   90   85  100  95  85      Python
1  정대만  북산고  184   40   35   50  55  25        Java
2  송태섭  북산고  168   70   75   70  80  75  javascript
3  서태웅  북산고  187   40   50   70  75  80
4  강백호  북산고  188   15   20   10  35  10
5  변덕규  능남고  202   80  100   95  85  80           C
6  황태산  능남고  188   55   65   45  40  35      PYTHON
7  윤대형  능남고  190  100   85   90  95  95          C#

In [13]:
df_data.columns

Index(['이름', '학교', '키', '국어', '영어', '수학', '과학', '사회', 'SW특기'], dtype='object')

In [14]:
df_data.isna().sum()

이름      0
학교      0
키       0
국어      0
영어      0
수학      0
과학      0
사회      0
SW특기    0
dtype: int64

In [15]:
df_data['이름']

0    채치수
1    정대만
2    송태섭
3    서태웅
4    강백호
5    변덕규
6    황태산
7    윤대형
Name: 이름, dtype: object

In [22]:
df_data[['이름', '키']]

    이름    키
0  채치수  197
1  정대만  184
2  송태섭  168
3  서태웅  187
4  강백호  188
5  변덕규  202
6  황태산  188
7  윤대형  190

In [25]:
df_data.to_csv('C:/Users/jycha/Desktop/AI/슬램덩크.csv')

In [28]:
dunk = pd.read_csv('C:/Users/jycha/Desktop/AI/슬램덩크.csv', index_col=0)

In [29]:
dunk

    이름   학교    키   국어   영어   수학  과학  사회        SW특기
0  채치수  북산고  197   90   85  100  95  85      Python
1  정대만  북산고  184   40   35   50  55  25        Java
2  송태섭  북산고  168   70   75   70  80  75  javascript
3  서태웅  북산고  187   40   50   70  75  80         NaN
4  강백호  북산고  188   15   20   10  35  10         NaN
5  변덕규  능남고  202   80  100   95  85  80           C
6  황태산  능남고  188   55   65   45  40  35      PYTHON
7  윤대형  능남고  190  100   85   90  95  95          C#

In [30]:
dunk.columns

Index(['이름', '학교', '키', '국어', '영어', '수학', '과학', '사회', 'SW특기'], dtype='object')

In [31]:
dunk.isna().sum()

이름      0
학교      0
키       0
국어      0
영어      0
수학      0
과학      0
사회      0
SW특기    2
dtype: int64

In [85]:
dunk['영어'][0:5]

0    85
1    35
2    75
3    50
4    20
Name: 영어, dtype: int64

In [86]:
dunk[['이름', '키']][:3]

    이름    키
0  채치수  197
1  정대만  184
2  송태섭  168

In [87]:
dunk.loc[[1]]

    이름   학교    키  국어  영어  수학  과학  사회  SW특기
1  정대만  북산고  184  40  35  50  55  25  Java

In [88]:
dunk.loc[[1,4]]

    이름   학교    키  국어  영어  수학  과학  사회  SW특기
1  정대만  북산고  184  40  35  50  55  25  Java
4  강백호  북산고  188  15  20  10  35  10   NaN

In [89]:
dunk.loc[[1,4], ['국어','영어','수학']]

   국어  영어  수학
1  40  35  50
4  15  20  10

In [90]:
dunk['키'] >= 185

0     True
1    False
2    False
3     True
4     True
5     True
6     True
7     True
Name: 키, dtype: bool

In [91]:
filt = (dunk['키'] >= 185)

In [92]:
filt

0     True
1    False
2    False
3     True
4     True
5     True
6     True
7     True
Name: 키, dtype: bool

In [93]:
k_score = (dunk['국어'] >= 80)

In [94]:
k_score

0     True
1    False
2    False
3    False
4    False
5     True
6    False
7     True
Name: 국어, dtype: bool

In [95]:
score = (dunk['국어'] >= 80) | (dunk['국어'] <= 20)

In [96]:
score

0     True
1    False
2    False
3    False
4     True
5     True
6    False
7     True
Name: 국어, dtype: bool

In [97]:
score1 = (dunk['국어'] >= 20) & (dunk['국어'] <= 80)

In [98]:
score1

0    False
1     True
2     True
3     True
4    False
5     True
6     True
7    False
Name: 국어, dtype: bool

In [99]:
dunk.loc[(dunk['국어'] >= 80) & (dunk['SW특기'] == 'Python')]

    이름   학교    키  국어  영어   수학  과학  사회    SW특기
0  채치수  북산고  197  90  85  100  95  85  Python